a = 2
print('Hello')

###########################################################################################
### Функции если есть return, то вернет значение, иначе возврат NotType или типо того ###

def is_number_power(x, y):
    if y == x**2 or x == y**2:
        print('да')
    else:
        print('нет')

###########################################################################################
### Форматированная строка ###
# f перед строкой и переменные в {}

print(f'{numbers} -> {max}')

###########################################################################################
### Приведение типов ###

number = int(input('Введите число: '))
a = list(range(-number, number+1))

###########################################################################################
### Попытка ###

try:    
    x = int(x)
    if x < 1 or x > 7:
        print('Ошибка!!! Введенное Вами число не соответствует указанному диапазону')
    elif x == 6 or x == 7:
        print(f'{x} -> да')
    elif x < 6:
        print(f'{x} -> нет')
except ValueError:
    print('Вводить можно только числа от 1 до 7, по-пробуйте еще раз.')

###########################################################################################
### Генерация листа и заполнение случайными числами ###

from random import randint

numbers = [randint(1, 100) for i in range(5)] # Создаем лист из 5 элементов и заполняем случайными числами от 1 до 100

